import pic1 from '../img/m-p-2.png'
import pic2 from '../img/m-p-3.png'
import pic3 from '../img/m-p-4.png'
import pic4 from '../img/m-p-5.png'
import pic5 from '../img/m-p-6.png'
import pic6 from '../img/m-p-7.png'

const product = {
    name: 'Міні-Проектор Дитячий',
    previousPrice: 1000,
    currentPrice: 699,
    currency: '₴',
    descriptionForBlocks: [
        {
            srcImg: pic1,
            title: 'Портативність та Автономність',
            text: 'Завдяки вбудованому акумулятору на 1000 МАг, цей мобільний принтер завжди готовий до роботи. До того ж його компактні розміри дозволяють легко помістити його в кишеню куртки або сумку.',
        },
        {
            srcImg: pic5,
            title: 'Відтворення та редагування',
            text: 'Переглядайте вміст перед друком на екрані вашого телефону та вносите останні правки перед тим, як фіксувати важливі моменти.',
        },
        {
            srcImg: pic2,
            title: 'Прямий Друк зі Смартфону',
            text: 'Підключіть Mini Printer до свого смартфона через Bluetooth 4.0, використовуючи офіційний додаток iPrint, та втілить у життя свої творчі ідеї. Більше жодних дротів!',
        },
        {
            srcImg: pic3,
            title: 'Термодрук Без Фарби',
            text: 'Процес термодруку забезпечує яскраве та чітке зображення, не вимагаючи використання фарби. Все, що вам потрібно - це термопапір, і ви готові до творчості.',
        },
        {
            srcImg: pic4,
            title: 'Швидкість та зручність',
            text: 'Роби нотатки та записки з легким задоволенням! Потрібно лише секунду зачекати - Ваше фото/нотатка готова! Також допоможе у продуктивності навчання та роботи.',
        },
        {
            srcImg: pic6,
            title: 'Чудовий подарунок!',
            text: 'Міні-принтер є хорошим подарунком, термодрук допоможе зберегти моменти з життя, а також має можливість відкрити потенціал дитини у справі з фотографією!',
        },
    ],
    description: [
        {
            title: 'Технология печати',
            text: 'Термопечать',
        },
        {
            title: 'Тип',
            text: 'Портативный принтер',
        },
        {
            title: 'Плотность печати',
            text: '203 т.дюйм',
        },
        {
            title: 'Цвет печати',
            text: 'Черно-белая',
        },
        {
            title: 'Ширина печати',
            text: '53 мм',
        },
        {
            title: 'Цвет',
            text: 'Розовый/Голубой/Желтый',
        },
        {
            title: 'Дополнительные характеристики',
            text: 'Печать без компьютера; Печать с телефона; Питание от аккумулятора; Питание от аккумулятора',
        },
        {
            title: 'Підтримка ОС',
            text: 'iOS, Android',
        },
    ]
    
}

export default product;