import pic1 from '../img/m-p-2.png'
import pic2 from '../img/m-p-3.png'
import pic3 from '../img/m-p-4.png'

const product = {
    name: 'Міні-Проектор Дитячий',
    previousPrice: 1000,
    currentPrice: 699,
    currency: '₴',
    descriptionForBlocks: [
        {
            srcImg: pic1,
            title: 'Проекція, що обертається на 360°',
            text: 'Spacebuddy™ повністю оснащений обертовою магнітною головкою, регульованими ручками, 8 кольоровими проекціями,  настройками яскравого та тьмяного освітлення та знімною підставкою для місяця!',
        },
        {
            srcImg: pic2,
            title: 'Проекція, що обертається на 360°',
            text: 'Spacebuddy™ повністю оснащений обертовою магнітною головкою, регульованими ручками, 8 кольоровими проекціями,  настройками яскравого та тьмяного освітлення та знімною підставкою для місяця!',
        },
        {
            srcImg: pic3,
            title: 'Проекція, що обертається на 360°',
            text: 'Spacebuddy™ повністю оснащений обертовою магнітною головкою, регульованими ручками, 8 кольоровими проекціями,  настройками яскравого та тьмяного освітлення та знімною підставкою для місяця!',
        },
    ],
    description: [
        {
            title: 'Тип',
            text: 'карманный принтер, портативный bluetooth принтер',
        },
        {
            title: 'Тип печати',
            text: 'Термопечать.',
        },
        {
            title: 'Плотность печати',
            text: '203 т.дюйм',
        },
        {
            title: 'Цвет печати',
            text: 'Черно-белая',
        },
        {
            title: 'Ширина печати',
            text: '53 мм',
        },
    ]
    
}

export default product;